package ru.example.appForCalculatingNetLoad.dataStructurs.Calculator.netLoadCalculator.objectForCalculation;

import lombok.AllArgsConstructor;
import lombok.Getter;

import java.util.Set;

@Getter
@AllArgsConstructor
public enum Regions {
    CENTRAL_FEDERAL_DISTRICT(0.81,
            Set.of("Белгородская область"
                    , "Брянская область"
                    , "Владимирская область"
                    , "Воронежская область"
                    , "Ивановская область"
                    , "Калужская область"
                    , "Костромская область"
                    , "Курская область"
                    , "Липецкая область"
                    , "Московская область"
                    , "Орловская область"
                    , "Рязанская область"
                    , "Смоленская область"
                    , "Тамбовская область"
                    , "Тверская область"
                    , "Тульская область"
                    , "Ярославская область"
                    , "г.Москва")),

    NORTHWEST_FEDERAL_DISTRICT(0.91,
            Set.of("Республика Карелия"
                    , "Вологодская область"
                    , "Калининградская область"
                    , "Ленинградская область"
                    , "Псковская область"
                    , "Новгородская область"
                    , "Мурманская область"
                    , "г.Санкт-Петербург"
                    , "Ненецкий автономный округ"
                    , "Республика Коми"
                    , "Архангельская область")),

    SOUTHERN_FEDERAL_DISTRICT(0.91,
            Set.of("Республика Адыгея (Адыгея)"
                    , "Республика Калмыкия"
                    , "Республика Крым"
                    , "Краснодарский край"
                    , "Астраханская область"
                    , "Волгоградская область"
                    , "Ростовская область"
                    , "г.Севастополь")),

    NORTH_CAUCASIAN_FEDERAL_DISTRICT(0.91,
            Set.of("Республика Дагестан"
                    , "Республика Ингушетия"
                    , "Кабардино-Балкарская Республика"
                    , "Карачаево-Черкесская Республика"
                    , "Республика Северная Осетия - Алания"
                    , "Чеченская Республика"
                    , "Ставропольский край")),

    VOLGA_FEDERAL_DISTRICT(0.91,
            Set.of("Республика Марий Эл"
                    , "Республика Мордовия"
                    , "Республика Татарстан (Татарстан)"
                    , "Удмуртская Республика"
                    , "Чувашская Республика - Чувашия"
                    , "Пермский край"
                    , "Кировская область"
                    , "Оренбургская область"
                    , "Пензенская область"
                    , "Самарская область"
                    , "Саратовская область"
                    , "Ульяновская область"
                    , "Республика Башкортостан"
                    , "Нижегородская область")),

    URAL_FEDERAL_DISTRICT(0.91,
            Set.of("Курганская область"
                    , "Свердловская область"
                    , "Тюменская область"
                    , "Челябинская область"
                    , "Ханты-Мансийский автономный округ - Югра"
                    , "Ямало-Ненецкий автономный округ")),

    SIBERIAN_AUTONOMOUS_DISTRICT(0.91,
            Set.of("Республика Алтай"
                    , "Республика Тыва"
                    , "Республика Хакасия"
                    , "Алтайский край"
                    , "Красноярский край"
                    , "Иркутская область"
                    , "Кемеровская область"
                    , "Новосибирская область"
                    , "Омская область"
                    , "Томская область")),

    FAR_EASTERN_FEDERAL_DISTRICT(0.91,
            Set.of("Республика Бурятия"
                    , "Республика Саха (Якутия)"
                    , "Забайкальский край"
                    , "Камчатский край"
                    , "Приморский край"
                    , "Хабаровский край"
                    , "Амурская область"
                    , "Магаданская область"
                    , "Сахалинская область"
                    , "Еврейская автономная область"
                    , "Чукотский автономный округ"));

    private final double coefficient;
    private final Set<String> names;
}
